---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.AssignTemplateOnViewCreation
source: html/f5c13a5b-1acd-927a-b124-9aef9a050bac.htm
---
# Autodesk.Revit.DB.ParameterTypeId.AssignTemplateOnViewCreation Property

"New views are dependent on template"

## Syntax (C#)
```csharp
public static ForgeTypeId AssignTemplateOnViewCreation { get; }
```